Revit 2027 API
HostObjectUtils Class
 These are generic host object utilities.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.HostObjectUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class HostObjectUtils
Public NotInheritable Class HostObjectUtils
public ref class HostObjectUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type HostObjectUtils = class end
The HostObjectUtils type exposes the following members.
Methods
Name | Description
GetBottomFaces |  Returns the bottom faces for this host object.
GetSideFaces |  Returns the major side faces for this host object.
GetTopFaces |  Returns the top faces for this host object.
Top
See Also
Reference
Autodesk.Revit.DB Namespace